aquahika/soccer-communication-module/firmware/RCj_link_module/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c5"
CONFIG_IDF_TARGET_ESP32C5=y
CONFIG_FREERTOS_HZ=1000
CONFIG_AUTOSTART_ARDUINO=n

# --- Radio: Wi-Fi/ESP-NOW ON, BLE OFF ---
# The link firmware talks module-to-module over ESP-NOW (Wi-Fi), not BLE.
# Wi-Fi is pulled in by the Arduino component; ESP-NOW ships with esp_wifi.
# Disable Bluetooth to free RAM (no BLE/referee-app path in this firmware).
CONFIG_BT_ENABLED=n

# --- Flash size ---
# Physical part reads 8 MB via JEDEC ID (esptool flash_id: mfr 0x20, dev 0x4017),
# despite the "N16R4" label in the hardware docs. Match the real chip.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# --- Released-build UART cleanliness ---
# The robot reads/writes its data on the UART0 line (U3 TX0/RX0). Keep that line clean:
# silence bootloader + ESP-IDF + Arduino-HAL logs so only the bridge's Serial bytes appear.
# Serial maps to UART0 because ARDUINO_USB_CDC_ON_BOOT is unset (do NOT enable it for release).
# For development logging over USB-C, layer sdkconfig.debug on top.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
CONFIG_LOG_DEFAULT_LEVEL_NONE=y
CONFIG_ARDUHAL_LOG_DEFAULT_LEVEL_NONE=y
